In [43]:
import pandas as pd

# Lê o arquivo CSV do GitHub, base:
# Programa Bolsa Família (PBF) - valor total dos benefícios em dezembro
pbf = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_PBF.csv", header=1)

pbf.head()

,Sigla,Código,Estado,2012,2013,2014,2016,2017,2018,2019,2020,2021,Unnamed: 12
0,AC,12,Acre,13541254,16150692,18666421,21613287,22170410,24004401,23844619,24790463,28141713,NaN
1,AL,27,Alagoas,64992708,68597362,75824150,74168706,75296822,79428048,76202903,79665294,93261844,NaN
2,AM,13,Amazonas,57464682,64639062,73645993,83929449,86896011,93845061,90215464,95075503,108584862,NaN
3,AP,16,Amapá,9427588,9710908,11158658,13266253,14807768,17155390,17204525,17655386,20195936,NaN
4,BA,29,Bahia,262704562,276757279,307377376,324058076,329339879,345273843,332690778,347601624,401903252,NaN

In [44]:
#Remover coluna vazia
pbf = pbf.drop(columns=["Unnamed: 12"], errors='ignore')

pbf.head()

,Sigla,Código,Estado,2012,2013,2014,2016,2017,2018,2019,2020,2021
0,AC,12,Acre,13541254,16150692,18666421,21613287,22170410,24004401,23844619,24790463,28141713
1,AL,27,Alagoas,64992708,68597362,75824150,74168706,75296822,79428048,76202903,79665294,93261844
2,AM,13,Amazonas,57464682,64639062,73645993,83929449,86896011,93845061,90215464,95075503,108584862
3,AP,16,Amapá,9427588,9710908,11158658,13266253,14807768,17155390,17204525,17655386,20195936
4,BA,29,Bahia,262704562,276757279,307377376,324058076,329339879,345273843,332690778,347601624,401903252

In [45]:
#Transpor coluna dos anos
pbf_df = pbf.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=pbf.columns[3:],var_name="Year", value_name="valor_pbf")

pbf_df.head()

  Sigla  Código    Estado  Year  valor_pbf
0    AC      12      Acre  2012   13541254
1    AL      27   Alagoas  2012   64992708
2    AM      13  Amazonas  2012   57464682
3    AP      16     Amapá  2012    9427588
4    BA      29     Bahia  2012  262704562

In [46]:
# Lê o arquivo CSV do GitHub, base:
# IDHM Ajustado à Desigualdade (IDHAD)
idhad = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_IDHAD.csv", header=1)

idhad.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,0.502,0.511,0.520,0.523,0.526,0.515,0.531,0.533,0.564,0.521,NaN
1,AL,27,Alagoas,0.475,0.471,0.481,0.483,0.491,0.494,0.490,0.500,0.517,0.505,NaN
2,AM,13,Amazonas,0.512,0.530,0.531,0.535,0.529,0.540,0.547,0.549,0.560,0.532,NaN
3,AP,16,Amapá,0.542,0.563,0.557,0.546,0.548,0.547,0.551,0.567,0.559,0.523,NaN
4,BA,29,Bahia,0.490,0.498,0.519,0.522,0.522,0.517,0.518,0.529,0.549,0.507,NaN

In [47]:
#Remover coluna vazia e transpor colunas dos anos
idhad = idhad.drop(columns=["Unnamed: 13"], errors='ignore')

idhad_df = idhad.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=idhad.columns[3:],var_name="Year", value_name="valor_idhad")

idhad_df.head()

  Sigla  Código    Estado  Year  valor_idhad
0    AC      12      Acre  2012        0.502
1    AL      27   Alagoas  2012        0.475
2    AM      13  Amazonas  2012        0.512
3    AP      16     Amapá  2012        0.542
4    BA      29     Bahia  2012        0.490

In [48]:
# Lê o arquivo CSV do GitHub, base:
# Esperança de vida ao nascer (EVN)
evn = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_EVN.csv", header=1)

evn.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,72.47,72.84,73.21,73.56,73.89,74.20,74.51,74.78,74.47,72.26,NaN
1,AL,27,Alagoas,69.96,70.37,70.77,71.16,71.54,71.90,72.25,72.60,72.15,69.87,NaN
2,AM,13,Amazonas,70.85,71.11,71.36,71.61,71.85,72.08,72.31,72.53,71.99,69.61,NaN
3,AP,16,Amapá,72.77,73.07,73.37,73.65,73.92,74.18,74.42,74.66,73.91,71.70,NaN
4,BA,29,Bahia,72.39,72.66,72.91,73.16,73.40,73.64,73.87,74.09,73.66,71.34,NaN

In [49]:
#Remover coluna vazia e transpor colunas dos anos
evn = evn.drop(columns=["Unnamed: 13"], errors='ignore')

evn_df = evn.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=evn.columns[3:],var_name="Year", value_name="valor_evn")

evn_df.head()

  Sigla  Código    Estado  Year  valor_evn
0    AC      12      Acre  2012      72.47
1    AL      27   Alagoas  2012      69.96
2    AM      13  Amazonas  2012      70.85
3    AP      16     Amapá  2012      72.77
4    BA      29     Bahia  2012      72.39

In [50]:
# Lê o arquivo CSV do GitHub, base:
# População Total
pop = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_PopTotal.csv", header=1)

pop.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,777461,790155,803127,816230,828436,840491,853023,865422,877688,889829,NaN
1,AL,27,Alagoas,3224172,3240801,3256780,3272460,3286849,3300736,3315564,3330079,3344244,3358030,NaN
2,AM,13,Amazonas,3540643,3605007,3670689,3736140,3798072,3859229,3921508,3983005,4043664,4103520,NaN
3,AP,16,Amapá,721361,737941,755067,772106,788892,805344,821545,837575,853412,869050,NaN
4,BA,29,Bahia,14422526,14485978,14546705,14609867,14670485,14730620,14793319,14853512,14911031,14965636,NaN

In [51]:
#Remover coluna vazia e transpor colunas dos anos
pop = pop.drop(columns=["Unnamed: 13"], errors='ignore')

pop_df = evn.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=evn.columns[3:],var_name="Year", value_name="valor_pop")

pop_df.head()

  Sigla  Código    Estado  Year  valor_pop
0    AC      12      Acre  2012      72.47
1    AL      27   Alagoas  2012      69.96
2    AM      13  Amazonas  2012      70.85
3    AP      16     Amapá  2012      72.77
4    BA      29     Bahia  2012      72.39

In [52]:
# Lê o arquivo CSV do GitHub, base:
# População de 6 a 14 anos de idade
pop_c = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_PopCriancas.csv", header=1)

pop_c.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,159815,158007,154279,166348,157801,150371,138550,142823,141524,141898,NaN
1,AL,27,Alagoas,552396,564918,558445,533776,513598,497024,478851,498995,512203,474644,NaN
2,AM,13,Amazonas,718386,702278,709275,661750,685385,668781,641420,683278,700976,644324,NaN
3,AP,16,Amapá,149962,141404,149909,148156,138948,131299,143322,140644,141662,131687,NaN
4,BA,29,Bahia,2298511,2307396,2215229,2213289,2118125,2105472,2025167,1991648,1957306,1914578,NaN

In [53]:
#Remover coluna vazia e transpor colunas dos anos:
pop_c = pop_c.drop(columns=["Unnamed: 13"], errors='ignore')

pop_c_df = pop_c.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=pop_c.columns[3:],var_name="Year", value_name="valor_pop_c")

pop_c_df.head()

  Sigla  Código    Estado  Year  valor_pop_c
0    AC      12      Acre  2012       159815
1    AL      27   Alagoas  2012       552396
2    AM      13  Amazonas  2012       718386
3    AP      16     Amapá  2012       149962
4    BA      29     Bahia  2012      2298511

In [54]:
# Lê o arquivo CSV do GitHub, base:
# Percentual de 6 a 14 anos de idade na escola
perc_e = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_PercCriancasEscola.csv", header=1)

perc_e.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,97.14,96.80,97.41,97.89,97.57,96.30,96.73,98.53,99.25,97.90,NaN
1,AL,27,Alagoas,97.49,96.77,97.82,97.13,98.28,98.49,98.85,98.60,99.04,96.69,NaN
2,AM,13,Amazonas,96.75,98.01,97.35,97.23,97.82,99.06,98.33,97.58,97.88,97.58,NaN
3,AP,16,Amapá,96.46,96.97,97.59,98.12,98.23,98.24,99.28,97.61,98.66,97.41,NaN
4,BA,29,Bahia,97.98,97.98,98.42,99.00,99.07,98.56,98.96,99.20,98.86,98.27,NaN

In [55]:
#Remover coluna vazia e transpor colunas dos anos:
perc_e = perc_e.drop(columns=["Unnamed: 13"], errors='ignore')

perc_e_df = perc_e.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=perc_e.columns[3:],var_name="Year", value_name="valor_perc_e")

perc_e_df.head()

  Sigla  Código    Estado  Year  valor_perc_e
0    AC      12      Acre  2012         97.14
1    AL      27   Alagoas  2012         97.49
2    AM      13  Amazonas  2012         96.75
3    AP      16     Amapá  2012         96.46
4    BA      29     Bahia  2012         97.98

In [57]:
df_unificado = pd.merge(perc_e_df, pop_c_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

  Sigla  Código    Estado  Year  valor_perc_e  valor_pop_c
0    AC      12      Acre  2012         97.14       159815
1    AL      27   Alagoas  2012         97.49       552396
2    AM      13  Amazonas  2012         96.75       718386
3    AP      16     Amapá  2012         96.46       149962
4    BA      29     Bahia  2012         97.98      2298511

In [58]:
df_unificado = pd.merge(df_unificado, pop_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

  Sigla  Código    Estado  Year  valor_perc_e  valor_pop_c  valor_pop
0    AC      12      Acre  2012         97.14       159815      72.47
1    AL      27   Alagoas  2012         97.49       552396      69.96
2    AM      13  Amazonas  2012         96.75       718386      70.85
3    AP      16     Amapá  2012         96.46       149962      72.77
4    BA      29     Bahia  2012         97.98      2298511      72.39

In [59]:
df_unificado = pd.merge(df_unificado, evn_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

,Sigla,Código,Estado,Year,valor_perc_e,valor_pop_c,valor_pop,valor_evn
0,AC,12,Acre,2012,97.14,159815,72.47,72.47
1,AL,27,Alagoas,2012,97.49,552396,69.96,69.96
2,AM,13,Amazonas,2012,96.75,718386,70.85,70.85
3,AP,16,Amapá,2012,96.46,149962,72.77,72.77
4,BA,29,Bahia,2012,97.98,2298511,72.39,72.39

In [60]:
df_unificado = pd.merge(df_unificado, idhad_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

,Sigla,Código,Estado,Year,valor_perc_e,valor_pop_c,valor_pop,valor_evn,valor_idhad
0,AC,12,Acre,2012,97.14,159815,72.47,72.47,0.502
1,AL,27,Alagoas,2012,97.49,552396,69.96,69.96,0.475
2,AM,13,Amazonas,2012,96.75,718386,70.85,70.85,0.512
3,AP,16,Amapá,2012,96.46,149962,72.77,72.77,0.542
4,BA,29,Bahia,2012,97.98,2298511,72.39,72.39,0.490

In [61]:
df_unificado = pd.merge(df_unificado, pbf_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

,Sigla,Código,Estado,Year,valor_perc_e,valor_pop_c,valor_pop,valor_evn,valor_idhad,valor_pbf
0,AC,12,Acre,2012,97.14,159815,72.47,72.47,0.502,13541254.0
1,AL,27,Alagoas,2012,97.49,552396,69.96,69.96,0.475,64992708.0
2,AM,13,Amazonas,2012,96.75,718386,70.85,70.85,0.512,57464682.0
3,AP,16,Amapá,2012,96.46,149962,72.77,72.77,0.542,9427588.0
4,BA,29,Bahia,2012,97.98,2298511,72.39,72.39,0.490,262704562.0